{
      "110t7p7": [
            "I forced my teen child to cut her hair as a punishment. Now I feel awful",
            "This whole account is a throw away and don't want my life being too open or exposed online more than this. \n\nFor some past knowledge that I will make brief, I (F34) have 2 kids, a son who is 5 and my 13yr old daughter. My ex husband and I grew up dirt poor and have worked hard. We got a degree that has blessed us financially. Him and I had kids and split after our son was a little over a year. My ex has remarried and we all have good relationship with eachother. Our daughter, who I will address as K for this, has had some major behavioral issues that everyone is at their wits end. \n   \nIf she is told no, she throws a screaming fit. If she has to share anything with her brother, step siblings, or half sister, she will intentionally hurt them by pushing them down, flipping her thick waste length hair in their face, or by screaming in their face. She will try to act all sweet and innocent when any adults get on to her about it. She lies to get her way and steals things from others too, and I noticed it's things that has meaning or value to a person so she can get a rise out of them or because it's something nice she wants and was told no on. She will also buy things for girls in her class to give them and then start to make fun of them with her group of friends because they are a \"helpless charity case\" (a teacher heard her say this). When this all first came up, we thought we were spoiling the kids too much and made the whole family start volunteering at homeless and animal shelters, counseling, on top of adult chores instead of 'kid chorse' (dishes, cleaning bathroom, ect) and relocated her to a new school. That was 3 years ago since we have started this and the only thing that changed is her acting out infront of adults... \n   \nTwo weeks ago, we got a call from the school and wanted to speak with us that day and to collect our daughter. We learned that K had a great idea to start a 'bully club' where they pick one girl in the school each week to \"mess with\" and if they can handle it, they can join their group and be friends. They actually only targeted a classmate for the past few months, who currently has cancer, and has been doing treatments. She is now at the point that she is losing hair and it's noticeable. I will call her H. I've met this girl and her parents. They are all amazing and no one deserves to be bullied, especially in their hard times. On that day, one of her friends brought a chargeable clippers and K ran a swipe with it on the back of H's head, cutting off a lot of her hair and leaving a huge bald area where the clippers went through. Her friends recorded the whole thing on their phones as they laughted and all the other students watched. I heard K tell H \"No one with short hair is beautiful\". I was beyond livid that she said and did that and it shocked me to my core. I felt helpless, like I had failed as a mother, and never felt that much anger than I had in that moment. I no longer saw my daughter but a monster and a mistake I had made. I grounded her from all electronics, took her home, told her to plant her butt on the kitchen stool. I grabbed a pair of scissors and cut that waste long hair to her shoulders. She started screaming and crying. I told her thanks for joinging your mom, step mom, dad, and siblings on the ugly side, as we all have short hair now. I then told her we are turning her hair I just cut into a wig and she will be giving it to H when K goes back to school, in front of everyone. She then started hyperventilating and crying worse. When her dad came over and heard everything, he said it was abusive and a bad mother. That being grounded and faceing possible suspension is the only right call. I disagreed. He left with her that night and now I am being told by everyone how cruel I am and I am seeing how it has affected my daughter.\n\n\nUPDATE: So I can no longer answer every single person here, but I will answer a lot of the questions I am seeing. Is she in therapy? Yes, when this first started 3 years ago I did. She is still with the person she started with. I plan to find someone else because they have said she has improved over the years and that clearly is not the case.\n\nWill I send her to military school? No. I have seen and read one too many of correctional places being unsafe. Im not okay with sending her to one.\n\nDoes dad get on to her/let her get away with things? Yes and no. He raises his voice and grounds her but never sticks with it. \n\nDoes she have a mental illness? No. When this all first started, I kept having medical doctors look at her. They all said nothing is wrong and recommened therapy, which she is in.\n\nIs she a sociopath/psychopath? I don't think so. I think they would of checked for that but I also think it would take longer to diagnose those things than just the short several weeks we did all that stuff. I plan to do a whole reevaluation on all forms soon. It takes a while for these appointments to be made and tests to get done. A lot of this stuff required a referral and it seemed forever to get that.\n\nFor the people who say this is not real... I've been dealing with this for 3 years... No one has really believed me until it got to this point. Now She at a school that is actually helping me and have parents to take accountablility for their own kids. People not  Believing me years ago has caused it to get to this point. Maybe don't do what I have done with my children so they will behave and this situation can stay imaginary for you. I'd do anything to switch you places too.\n\nEveryone has been asking for an update. Im not sure if I feel comfortable doing that, but we will see if and when the appointments happen."
      ],
      "1115seq": [
            "trying to help my husband in any capacity is fucking futile",
            "i’m losing my patience more and more each day. he has ADHD and bipolar disorder. i’ve been reminding him to make a doctors appointment for two days now to get a renewal for his adderall, cause it helps him function throughout the day. he keeps saying “i’ll do it” but literally just fucking WONT!! i even went online and sent him the link to the site to make the appointment. it’s fucking pointless\n\ni thought about just making the appointment for him but i’m really trying not to be his mother and making him do things for himself and suffering the consequences. it’s been so difficult sitting back. i can actively feel the resentment growing and there’s absolutely nothing i can do\n\ntalking to him is futile. reminding him is futile. doing it for him is futile. and it’s probably because he’s been unmedicated for so long!! what the fuck can i even do at this point????? i try to stress how important this is and he brushes me off and tries to make light of it. it’s not light!!\n\nhe’s the one ignoring me and his work load. he’s the one going to sleep at 6-7am and waking up at 7pm. he’s the one pulling all nighters and fucking up his schedule more. he’s the one being late to work all the time, which actually delayed him getting his raise until he fixed his attendance\n\ni’ve suggested therapy. i’ve suggested he find a new job (he doesn’t like his job). i’ve talked to him about how all of this impacts me and how i feel about it. i’ve asked how he feels about it. you know what responses i get to these concerns??? “i just need to do better.” WHICH HE HAS PROVEN THAT HE CANNOT DO ON HIS OWN. so now when he says that he’ll do something, i know for a fucking fact that he won’t and i do it myself. i don’t even bother asking anymore actually\n\ni herniated a disc in my spine in december and i’m still healing from it. i’m able to bend over but i was advised not to if it can be avoided. so i’ve been asking him for the last 3 days to unload the bottom of the dishwasher. i unloaded the top part cause i don’t have to bend over for that. i just need him to unload the bottom, and probably also load it. he won’t do it. our sink is fucking disgusting rn because of that\n\nhe says he’ll make dinner and he doesn’t. he says he’ll take out the trash and he doesn’t. he said he would drop off my lunch at work at a certain time but was over an hour late, after i had already finished my lunch break. he says he’ll make an appointment and doesn’t. he says he’ll go to sleep at a certain time and doesn’t. wholly unreliable\n\nand don’t even get me started on our sex life. ITS PRETTY MUCH NON EXISTENT. we’re down to like 2-3 times a month, and it keeps dwindling. we’ve had sex once in the last two weeks. i doubt we’ll even have sex on valentine’s day. again, i talk to him about it and nothing changes. no attention is given to me, it’s all very vanilla and standard and matter-of-fact. i want more. i know it’s probably his meds. that’s why i want him to talk to the goddamn doctor!\n\ni’m at my wits end honestly. can you tell"
      ],
      "110sl47": [
            "I love my wife but I can’t stand my kids",
            "My wife and I were married for seven years before we started having kids. We knew that we had different opinions about kids from before we got engaged. She wanted a big family, at least three kids. I wasn’t all that into kids in general, and thought three would be a lot, but I also figured that fatherhood is a pretty normal part of adulthood and that I didn’t feel strongly enough to deny her the kids she wanted so much. \n\nBig mistake. \n\nOur kids just enrage me from morning to night. They are so loud, they don’t listen to anything I say, they shout over me and one another, they hit, they break shit all the time, and they just suck the joy out of my waking hours. Before we had kids, we travelled a lot, went out and enjoyed each other’s company. Now, we argue over parenting, money, and who is more exhausted and overstretched. I am thoroughly unhappy and can hardly muster the energy to get out of bed in the morning to face these days. \n\nI still love my wife and relish when we can have some quiet time to ourselves and recharge (thank god for grandparents). But every day there comes a point where I wonder if everyone wouldn’t be better off if we split. I’m not making my kids’ lives better by being here, and my mental health is wrecked. \n\nGuys, don’t think that you can just adapt to parenthood if kids aren’t something you really want. You need that drive to make it through, and it’s not just going to magically appear. It’s hard to uncouple from someone you love over this, but better to do so before you’re in the thick of it."
      ],
      "1116wap": [
            "I PASSED MY EXAM!!",
            "Laws are hard my friends. I failed the first time BUT WON'T FAIL TWICE.\nI hope all of you achieve your goals in life. Idm if you're a student trying to pass exams or a grown ass person thriving. Have faith in yourself <3"
      ],
      "110yirt": [
            "Man followed me home to my dorm bc I rejected him in the Krogers parking lot",
            "\n\nI was on the phone with my my mom getting groceries at Krogers. As I was walking out with my hands full, there was a guy standing by his car parked next to mine. As I'm putting my groceries in the car and talking to my mom, this guy says to me \"Shii where u going?\" Trying to flirt me. I look at him, annoyed in disgusts and reply, \"Home.\" Without a second thought.. He stands there in silence and watches me get in my car and then gets in his slowly following behind me. I tell my mom I have to get off the phone because I noticed he was following me. I immediately  call the cops to tell them where my location is and where to meet them.  This man followed me in my car FOR 30 FUCKING MINUTES. While I was on the phone trying to stay calm I see a police officer on thre side of a traffic area that was right beforethe entrance of my dorm. I pull up behind him flashing my lights running out of my car asking for help. He runs out of his I point to the car and tell him what happened but the guy who was following me ran a light and got away.  Never in my life have I ever met this man. The fact me saying ONE WORD hurt his ego and triggered him to follow me is so bizzare.  I can't help but wonder what he planned on doing to me had I not noticed he was following me the whole time. LADIES, pleasee STAY AWARE of your surroundings. \n\nRunning out of my car wasn't the best thing to do but I couldn't help but wonder if he had a gun and was going to try and shoot me while driving. Idk I got overwhelmed and panicked. I always fear  this happening again.  \n\nThis is a consistent problem I see happening to a lot of other  women. To the weirdos who do shit like this, why do yall feel so fucking entitled?  No one OWES YOU ANYTHING. No one likes you, and no one ever will. Eat shit."
      ],
      "1114sud": [
            "I was kicked out but now they need me",
            "Read other post for more insight \n\nI (F24) usually take my sister (7) to school or pick her up when my mother is working. I don't mind doing that because it involves the only family member I actually care about. She never shows me gratitude because it's what the older siblings are supposed to do.\n\nThey're now pretending like I wasn't kicked out and just left without telling them. My mother is working early shifts this week so my father texted: \"Your sister needs you\" He is in another country due to a family member passing so I'm the only one available. The eldest moved out a year ago and has to work herself and the other one has school.\n\nI did move out. I packed most of my things and me and my BF will be looking for an apartment soon. My parents don't take this seriously and expect me to move back."
      ],
      "110ys3q": [
            "Marriage abuse",
            "My marriage is very much oriented around the husband is the head of the house hold.  Husband 36 I am 26 He started smacking me on the arm, then pulling my hair then smacking me on the head. Over time more and more for little things. Today we got home from going out to eat and having a great time. He said I was making to much noise doing the dishes I snapped back and said sorry I have to get this done, he lunged at me from across the house and I go around the table and tell him to stop and put my hands up, he grabs the dishes and throws them down they break everywhere!! Our daughter is near I run to the other room with her, while rest of the day he was quiet and I left and came home and of course he’s being quiet, I called my mother crying and told her I don’t know how much I can take…. I’m always wrong or always I have to listen to him. How can he keep getting away with this behavior and we just act like nothing has happened, yet I sit here scared one day he will really hurt me worse?"
      ],
      "1111hv5": [
            "I broke up with my boyfriend because of his views on cheating",
            "This is a throwaway. I don't know what to feel. Me (25f) and my boyfriend (28m) have been together for 3 years now. We are have been living together for 2 years. I know his family. He has one brother, Sam (33m) who is married to Lisa (32f). They have one daughter who is 4 years old. He is very close to his brother which resulted in me being closer to his wife and kids too. Sam sometimes comes to our place and plays video games with my bf. Oneday, when they were playing video Sam put his phone on charger in our guest room. I was there cleaning the windows when suddenly his phone buzzed. I went to look and there was a girl named \"Office\" texting him \"I had a great time last night. Your tongue is magic.\" with some emojis. I was a little shocked. Sam always shows how much he adores his wife. Even Lisa says he is the best husband. How could he cheat? This was the first incident. Then oneday when he was at our house again, he was talking loudly while I was right by the kitchen while he was talking on the phone in our guest room with doors open. He was saying \"I love you\" to a girl names \"Beth\". This confirmed my suspicioun even more. I told my boyfriend I think his brother is cheating on his wife. I asked him if he knows anything about it.\n\nHis expression went blank. He told me he knew about it. I was perplexed. I asked what does he mean. He began to tell me Sam has been seeing other girls on the side. He doubled it down saying it is not a big deal because Lisa is happy, he is happy and plus he doesn't like to medel in other people's business. I asked him if he thinks that his brother cheating on Lisa was right. How could he defend his brother over something so vile. He told me it is their personal life. Plus he doesn't want to ruin his brother's marriage. I told him firmly his brother's marriage was already ruined the moment he decided to stick his dick inside someone else that isn't his wife and he clearly wrong for supporting him. How would he feel if I was cheating on him and my sister knew and never told him? He told of course he would feel bad. But this isn't about him. I just told him to leave me alone. Cheating is a deal breaker for me. I do not like people who are cheaters or suppor cheating. I can't even look at him the same way I used to. So, few weeks ago, I called him and told him this isn't working. I cannot be with someone who supports cheating and doesn't mind someone else cheating. He cried and told me to not do it. That he will do better and this isn't fair to him. I cannot punish him for what his brother is doing. I told him calmly that this is not a punishment but my decision. I already told him that cheating is a dealbreaker for me. I will not tolerate it in any shape or form. I went to stay with my brother.\n\nTwo days later I went to our place to get some stuff of mine. He asked me if he could talk. I said sure. He told me he was wrong for not saying anything against his own brother. Lisa is a good woman and that he would ask his brother to stop. I told him that doesn't make me feel better. The fact that he thinks it is okay to cheat clearly shows he has no problem with cheating on me. He told me he is not cheating on me and that he will be better. I asked him if he could tell Lisa about his husband's affair. He went silent and told me he can't go against his own brother. Well then I guess he made his choices. I left his place leaving him crying on his couch. I feel bad. I love him but the trust I had for him is gone. I do not know how to tell everything to Lisa. I am not sure what to do. I feel lost.\n\nEdit: To those idiots who says that my bf is not wrong I hope you find yourself in a similar situation as Lisa. I would like to know how would you feel when you learn that your husband betrayed you and people close to you knew about it and let you get cheated on day after day. He has covered for his brother on many occasions. He has lied to to Lisa telling her that Sam is with him when he was not. Even if he didn't him simply acting it is not a big deal that a woman who is so loyal to her husband is getting cheated on is wrong and malicious in my eyes. Him concealing his cheating is also putting her at risk of STDs and also what if Sam got one of those girls pregnant? Ever thought about that? It's not like they were in open or poly relationship.\n\nEdit 2: I cannot comment on my own post. What is up with that? It gets removed. But to anyone who is asking, I will tell Lisa. She currently out of town. I can send her a message but I have no evidence that Sam is cheating. Plus she told me she would not be near her phone."
      ],
      "110webd": [
            "As a service industry worker I totally agree with the non tippers sentiment. My employer should pay me a living wage not the customers, and if he can’t afford to pay his own employees then he shouldn’t own a restaurant.",
            ""
      ]
}